package com.eghm.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 系统错误信息枚举 包含系统所以的异常信息
 * 404 500等标准错误码返回前台时,可做特殊处理(多个业务共用一个错误码)
 * 1000+ 数据异常
 * 2000+ 业务异常
 *
 * @author 二哥很猛
 */
@AllArgsConstructor
@Getter
public enum ErrorCode {

    SUCCESS(200, "请求成功"),

    /**
     * 用户登陆已过期
     */
    LOGIN_TIMEOUT(8848, "登陆过期,请重新登陆"),

    /**
     * 表示用户没有注册,需要进行手机号授权注册并登录
     */
    MEMBER_REGISTER(8849, "请先授权登录"),

    /**
     * 点击太快啦~~
     */
    SUBMIT_FREQUENTLY(400, "操作太快啦~~"),

    /**
     * 亲~ 暂时没有访问权限哦
     */
    ACCESS_DENIED(403, "亲~ 暂时没有访问权限哦"),

    /**
     * 木有找到请求地址
     */
    PAGE_NOT_FOUND(404, "木有找到请求地址"),

    /**
     * 暂无访问权限 (黑名单拦截)
     */
    SYSTEM_AUTH(405, "暂无访问权限"),

    /**
     * 系统繁忙,请稍后再试
     */
    SYSTEM_ERROR(500, "系统繁忙,请稍后再试"),

    /**
     * 线程中断异常
     */
    THREAD_INTERRUPTED(501, "线程中断异常"),

    /**
     * 应用上下文尚未完全启动
     */
    SPRING_ON_LOADING(505, "Spring上下文尚未完全启动"),

    /**
     * 地址不支持%s请求
     */
    METHOD_NOT_SUPPORTED(505, "地址不支持%s请求"),

    /**
     * 数据转换异常
     */
    JSON_FORMAT_ERROR(1000, "数据转换异常"),

    /**
     * pbe加密失败
     */
    ENCRYPT_ERROR(1001, "数据加密失败"),

    /**
     * 字符集转换错误
     */
    CHARSET_CONVERT_ERROR(1002, "字符集转换错误"),

    /**
     * 数据解密失败
     */
    DECRYPT_ERROR(1003, "数据解密失败"),

    /**
     * 数据加解密失败
     */
    ENCRYPT_DECRYPT_ERROR(1004, "数据加解密失败"),

    /**
     * 对象转换异常
     */
    BEAN_COPY_ERROR(1005, "对象转换异常"),

    /**
     * 数据加密异常,请联系管理人员
     */
    SHA_256_ERROR(1006, "数据加密异常"),

    /**
     * 验签异常
     */
    SIGN_NULL_ERROR(1007, "验签异常"),

    /**
     * 验签失败
     */
    SIGN_ERROR(1008, "验签失败"),

    /**
     * 未指定方法实现
     */
    NOT_IMPLEMENT(1009, "未指定方法实现"),

    /**
     * 参数转换异常
     */
    PARAMETER_CASE_ERROR(1010, "参数转换异常"),

    /**
     * 未知主机名
     */
    UN_KNOW_HOSTNAME(1011, "未知主机名"),

    /**
     * 未知主机地址
     */
    UN_KNOW_HOST_ADDRESS(1012, "未知主机地址"),

    /**
     * 请求接口非法
     */
    REQUEST_INTERFACE_ERROR(1013, "请求接口非法"),

    /**
     * 请求参数非法
     */
    REQUEST_PARAM_ILLEGAL(1014, "请求参数非法"),

    /**
     * 请求解析异常
     */
    REQUEST_RESOLVE_ERROR(1015, "请求解析异常"),

    /**
     * 签名信息为空
     */
    SIGNATURE_ERROR(1018, "签名信息为空"),

    /**
     * 时间戳为空
     */
    SIGNATURE_TIMESTAMP_NULL(1020, "数字签名为空"),

    /**
     * 签名信息已过期
     */
    SIGNATURE_EXPIRE(1023, "签名信息已过期"),

    /**
     * 请求已过期
     */
    SIGNATURE_TIMESTAMP_ERROR(1025, "签名信息已过有效期"),

    /**
     * 签名校验异常
     */
    SIGNATURE_VERIFY_ERROR(1031, "签名校验失败"),

    /**
     * 读取请求参数异常
     */
    READ_PARAM_ERROR(1033, "读取请求参数异常"),

    /**
     * 非法操作 操作了不属于自己的数据
     */
    ILLEGAL_OPERATION(1035, "非法操作"),

    /**
     * 非管理员,无权限进行授权操作
     */
    ADMIN_AUTH(1043, "非管理员,无权限进行授权操作"),

    /**
     * 转换器不支持非枚举类
     */
    ENUM_SUPPORTED(1045, "转换器不支持非枚举类"),

    /**
     * 定时任务尚未激活
     */
    TASK_CONFIG_NULL(1046, "定时任务尚未激活"),

    /**
     * 定时任务配置异常
     */
    TASK_CONFIG_ERROR(1050, "定时任务配置异常"),

    /**
     * 任务未查询到
     */
    TASK_NULL_ERROR(1057, "任务未查询到"),

    /**
     * 数据权限不匹配
     */
    DATA_TYPE_ERROR(1059, "数据权限不匹配"),

    /**
     * 缓存不能为空
     */
    CACHE_VALUE_NULL(1101, "缓存不能为空"),

    /**
     * 屏幕锁定中
     */
    LOCK_SCREEN(1111, "屏幕锁定中"),

    /**
     * 该字段类型不支持脱敏
     */
    FIELD_NOT_SUPPORTED(1122, "该字段类型不支持脱敏"),

    /**
     * 参数解析异常
     */
    PARAM_VERIFY_ERROR(2000, "%s"),

    /**
     * 参数解析异常
     */
    PARAM_NULL_ERROR(2000, "%s参数不能为空"),

    /**
     * 身份证格式错误
     */
    ID_CARD_ERROR(2001, "身份证格式错误"),

    /**
     * 对象不能为空
     */
    NOT_NULL_ERROR(2002, "对象不能为空"),

    /**
     * select指定nid不能为空
     */
    NID_IS_NULL(2003, "@select指定nid不能为空"),

    /**
     * 权限校验异常,请联系管理人员
     */
    PERMISSION_ERROR(2004, "权限校验异常,请联系管理人员"),

    /**
     * 日志异常,用户未登陆
     */
    OPERATION_LOGIN_ERROR(2005, "日志异常,用户未登陆"),

    /**
     * auth指定的nid不能为空
     */
    AUTH_NID_ERROR(2006, "@auth指定的nid不能为空"),

    /**
     * 日期格式转换异常
     */
    DATE_CASE_ERROR(2007, "日期格式转换异常"),

    /**
     * 日期格式必须为yyyy-MM-dd
     */
    DATE_ERROR(2022, "日期格式必须为yyyy-MM-dd"),

    /**
     * 模板解析失败
     */
    TEMPLATE_RENDER_ERROR(2008, "模板解析失败"),

    /**
     * 手机号码被占用
     */
    MOBILE_REDO(2010, "手机号码被占用"),

    /**
     * 系统默认角色,禁止删除
     */
    ROLE_FORBID_DELETE(2013, "系统默认角色,禁止删除"),

    /**
     * 角色名称重复
     */
    ROLE_NAME_REDO(2015, "角色名称重复"),

    /**
     * 角色信息不存在
     */
    ROLE_NULL(2016, "角色信息不存在"),

    /**
     * ip格式错误
     */
    IP_ILLEGAL(2030, "ip格式错误"),

    /**
     * 开始ip必须小于截止ip
     */
    IP_RANGE_ILLEGAL(2032, "开始ip必须小于截止ip"),

    /**
     * 系统配置信息未查询到
     */
    CONFIG_NOT_FOUND_ERROR(3000, "系统配置信息未查询到"),

    /**
     * 系统配置信息更新失败
     */
    UPDATE_CONFIG_ERROR(3001, "系统配置信息更新失败"),

    /**
     * 菜单信息更新失败
     */
    UPDATE_MENU_ERROR(3002, "菜单信息更新失败"),

    /**
     * 父菜单不存在
     */
    PID_MENU_NULL(3402, "父菜单不存在"),


    /**
     * 菜单名称重复啦
     */
    MENU_TITLE_REDO(3403, "菜单名称重复啦"),

    /**
     * 菜单显示状态与父菜单不匹配
     */
    PID_MENU_STATE(3404, "菜单显示状态与父菜单不匹配"),

    /**
     * 验证码输入错误
     */
    IMAGE_CODE_ERROR(3003, "验证码输入错误"),

    /**
     * 账户或密码错误
     */
    ACCOUNT_PASSWORD_ERROR(3004, "账户或密码输入错误"),

    /**
     * 用户信息不存在
     */
    USER_NOT_FOUND(3005, "用户信息不存在"),

    /**
     * 用户已锁定,请联系管理人员
     */
    USER_LOCKED_ERROR(3006, "用户已锁定,请联系管理人员"),

    /**
     * 系统参数已锁定
     */
    CONFIG_LOCK_ERROR(3007, "系统参数已锁定"),

    /**
     * 旧密码输入错误
     */
    USER_PASSWORD_ERROR(3010, "旧密码输入错误"),

    /**
     * 上传文件过大
     */
    UPLOAD_TOO_BIG(3011, "上传文件过大"),

    /**
     * 文件保存失败
     */
    FILE_SAVE_ERROR(3012, "文件保存失败"),

    /**
     * 创建文件失败
     */
    FILE_CREATE_ERROR(3013, "创建文件失败"),

    /**
     * 该数据字典已锁定,不支持删除
     */
    DICT_LOCKED_ERROR(3014, "该数据字典已锁定,不支持删除"),

    /**
     * 同级菜单最多90个
     */
    MENU_MAX_ERROR(3015, "同级菜单最多90个"),

    /**
     * 用户已在其他设备上登陆
     */
    MULTIPLE_CLIENT_LOGIN(3016, "用户已在其他设备上登陆"),

    /**
     * 用户不存在
     */
    MEMBER_NOT_FOUND(3017, "用户不存在"),

    /**
     * 该手机号尚未注册
     */
    MEMBER_NOT_REGISTER(3017, "该手机号尚未注册"),

    /**
     * 账号或密码错误
     */
    PASSWORD_ERROR(3018, "账号或密码错误"),

    /**
     * 验证码已过期
     */
    LOGIN_SMS_CODE_EXPIRE(3019, "验证码已过期"),

    /**
     * 短信验证码错误
     */
    LOGIN_SMS_CODE_ERROR(3020, "验证码输入错误"),

    /**
     * 手机号未注册
     */
    MOBILE_NOT_REGISTER(3021, "手机号未注册"),

    /**
     * 短信发送频率太快
     */
    SMS_FREQUENCY_FAST(3022, "短信发送频率太快"),

    /**
     * 单位小时内短信发送上限
     */
    SMS_HOUR_LIMIT(3023, "单位小时内短信发送上限"),

    /**
     * 当天内短信发送上限(统一类型短信)
     */
    SMS_DAY_LIMIT(3024, "当天内短信发送上限"),

    /**
     * 当天内短信发送上限(统一手机号短信)
     */
    MOBILE_DAY_LIMIT(3025, "当天内短信发送上限"),

    /**
     * 版本号重复
     */
    VERSION_REDO(3325, "版本号重复"),

    /**
     * 该手机号已注册
     */
    MOBILE_REGISTER_REDO(3026, "该手机号已注册"),

    /**
     * cron表达式配置错误
     */
    CRON_CONFIG_ERROR(3027, "cron表达式配置错误"),

    /**
     * 按钮菜单无法添加子菜单
     */
    SUB_MENU_ERROR(3027, "按钮菜单无法添加子菜单"),

    /**
     * 内容不能为空
     */
    TEXT_CONTENT_EMPTY(3028, "内容不能为空"),

    /**
     * 新设备登陆校验
     */
    NEW_DEVICE_LOGIN(3029, "新设备登陆校验"),

    /**
     * 账号在其他设备上登陆
     */
    KICK_OFF_LINE(3030, "账号在其他设备上登陆"),

    /**
     * 邮件服务可能未配置
     */
    MAIL_NOT_CONFIG(3031, "邮件服务可能未配置"),

    /**
     * 部门层级已上限
     */
    DEPARTMENT_DEPTH_ERROR(3032, "部门层级已上限"),

    /**
     * 邮件模板未配置
     */
    EMAIL_TEMPLATE_NULL(3045, "邮件模板未配置"),

    /**
     * 请勿重复绑定邮箱
     */
    EMAIL_REDO_BIND(3048, "请勿重复绑定邮箱"),

    /**
     * 请先获取邮箱验证码
     */
    EMAIL_ADDRESS_ERROR(3050, "请先获取邮箱验证码"),

    /**
     * 邮箱验证码输入错误
     */
    EMAIL_CODE_ERROR(3050, "邮箱验证码输入错误"),

    /**
     * 邮箱已被占用
     */
    EMAIL_OCCUPY_ERROR(3053, "邮箱已被占用"),

    /**
     * 请先绑定手机号
     */
    MOBILE_NOT_BIND(3055, "请先绑定手机号"),

    /**
     * 请勿重复签到
     */
    SIGN_IN_REDO(3058, "请勿重复签到"),

    /**
     * 数据格式异常
     */
    DATA_ERROR(3059, "数据格式异常"),

    /**
     * 用户地址未查询到
     */
    MEMBER_ADDRESS_NULL(3062, "用户地址未查询到"),

    /**
     * 省份异常
     */
    PROVINCE_ERROR(3066, "省份异常"),

    /**
     * 城市异常
     */
    CITY_ERROR(3069, "城市异常"),

    /**
     * 县区异常
     */
    COUNTY_ERROR(3073, "县区异常"),

    /**
     * 站内信模板未配置
     */
    IN_MAIL_NULL(3075, "站内信模板未配置"),

    /**
     * 开奖程序出错啦
     */
    LOTTERY_ERROR(3088, "开奖程序出错啦"),

    /**
     * 请先配置支付信息
     */
    PAY_CONFIG_ERROR(3090, "请先配置支付信息"),

    /**
     * 支付接口超时
     */
    CREATE_PAY_ERROR(3092, "支付接口超时"),

    /**
     * 未知支付方式(微信)
     */
    UNKNOWN_PAY_TYPE(3093, "未知支付方式"),

    /**
     * 订单查询失败
     */
    ORDER_QUERY_ERROR(3094, "订单查询失败"),

    /**
     * 订单关闭失败
     */
    ORDER_CLOSE(3095, "订单关闭失败"),

    /**
     * 支付响应错误
     */
    PAY_ERROR(3111, "支付响应错误"),

    /**
     * 支付订单创建失败
     */
    PAY_ORDER_ERROR(3110, "支付订单创建失败"),

    /**
     * 退款请求超时,请稍后再试
     */
    WECHAT_REFUND_APPLY(3112, "退款请求超时,请稍后再试"),

    /**
     * 退款请求超时,请稍后再试
     */
    ALI_REFUND_APPLY(3101, "退款请求超时,请稍后再试"),

    /**
     * 退款订单查询失败
     */
    REFUND_QUERY(3113, "退款订单查询失败"),

    /**
     * 支付异步通知解析失败
     */
    NOTIFY_PAY_PARSE(3114, "支付异步通知解析失败"),

    /**
     * 退款异步通知解析失败
     */
    NOTIFY_REFUND_PARSE(3115, "退款异步通知解析失败"),

    /**
     * 接口不支持该方法调用
     */
    NOT_SUPPORTED(3116, "接口不支持该方法调用"),

    /**
     * 短信验证码过期啦~
     */
    REQUEST_ID_EXPIRE(3117, "短信验证码过期啦~"),

    /**
     * 收货地址太多啦
     */
    ADDRESS_MAX(3118, "收货地址太多啦~"),

    /**
     * 收货地址不见啦~
     */
    ADDRESS_NULL(3119, "收货地址不见啦~"),

    /**
     * 版本号格式错误
     */
    VERSION_ERROR(3120, "版本号格式错误"),

    /**
     * 使用中的版本无法删除
     */
    CURRENT_VERSION_DELETE(3121, "使用中的版本无法删除"),

    /**
     * 枚举格式化失败
     */
    ENUMS_FORMAT(3123, "枚举格式化失败"),

    /**
     * 异步通知验签失败
     */
    NOTIFY_SIGN_ERROR(3114, "异步通知验签失败"),

    /**
     * 非int或long格式无法转换
     */
    CONVERT_ERROR(3128, "非int或long格式无法转换"),

    /**
     * 商户名称重复啦~
     */
    MERCHANT_REDO(3129, "商户名称重复啦~"),

    /**
     * 社会统一信用代码重复啦~
     */
    CREDIT_CODE_REDO(3131, "社会统一信用代码重复啦~"),

    /**
     * 商户手机号被占用
     */
    MERCHANT_MOBILE_REDO(3130, "商户手机号被占用"),

    /**
     * 商户角色未配置
     */
    MERCHANT_ROLE_NULL(3132, "商户角色未配置"),

    /**
     * 民宿名称被占用
     */
    HOMESTAY_TITLE_REDO(3134, "民宿名称被占用"),

    /**
     * 时间跨度不能超过{}天
     */
    MAX_DAY(3136, "时间跨度不能超过%s天"),

    /**
     * 该景区已下架
     */
    SCENIC_DOWN(3137, "该景区已下架"),

    /**
     * 该门票已下架
     */
    TICKET_DOWN(3138, "该门票已下架"),

    /**
     * 优惠券抢完啦
     */
    COUPON_EMPTY(3139, "优惠券抢完啦~"),

    /**
     * 优惠券不在领取时间
     */
    COUPON_INVALID_TIME(3140, "优惠券不在领取时间内"),

    /**
     * 优惠券领取上限啦
     */
    COUPON_MAX(3141, "优惠券领取上限啦~"),

    /**
     * 优惠券领取方式不匹配
     */
    COUPON_MODE_ERROR(3142, "优惠券领取方式不匹配"),

    /**
     * 优惠券不存在
     */
    COUPON_NOT_FOUND(3143, "优惠券不存在"),

    /**
     * 优惠券不合法
     */
    COUPON_ILLEGAL(3144, "优惠券不合法"),

    /**
     * 商品不支持该优惠券
     */
    COUPON_MATCH(3145, "商品不支持该优惠券"),

    /**
     * 优惠券不在有效期
     */
    COUPON_USE_ERROR(3146, "优惠券不在有效期"),

    /**
     * 优惠券不满足使用条件
     */
    COUPON_USE_THRESHOLD(3147, "不满足优惠券使用条件"),

    /**
     * 购物车数量不能超过%s个
     */
    SHOPPING_CART_MAX(3148, "购物车数量不能超过%s个"),

    /**
     * 该商品已下架
     */
    ITEM_DOWN(3149, "该商品已下架"),

    /**
     * 存在已下架的商品
     */
    SKU_DOWN(3150, "存在已下架的商品"),

    /**
     * 商品规格不匹配
     */
    ITEM_SKU_MATCH(3151, "商品规格不匹配"),

    /**
     * 该商品库存不足
     */
    SKU_STOCK(3152, "该商品库存不足"),

    /**
     * 超出商品限购数量
     */
    ITEM_QUOTA(3153, "超出商品限购数量"),

    /**
     * 购物车商品信息不存在
     */
    CART_ITEM_EMPTY(3154, "购物车商品信息不存在"),

    /**
     * 门票库存不足
     */
    TICKET_STOCK(3155, "门票库存不足"),

    /**
     * 请填写游客信息
     */
    TICKET_VISITOR(3156, "请填写游客信息"),

    /**
     * 门票单次购买上限为%s张
     */
    TICKET_QUOTA(3258, "单次购买上限为%s张"),

    /**
     * 订单类型不匹配
     */
    ORDER_TYPE_MATCH(3157, "订单类型不匹配"),

    /**
     * 订单信息不存在
     */
    ORDER_NOT_FOUND(3158, "订单信息不存在"),

    /**
     * 订单状态已变更
     */
    ORDER_PAID(3159, "订单状态已变更"),

    /**
     * 订单已支付,无法取消
     */
    ORDER_PAID_CANCEL(3160, "订单已支付,无法取消"),

    /**
     * 该商品不支持退款
     */
    REFUND_NOT_SUPPORTED(3160, "该商品不支持退款"),

    /**
     * 该订单状态不支持退款
     */
    STATE_NOT_REFUND(3161, "该订单状态不支持退款"),

    /**
     * 订单退款中,请勿重复申请
     */
    REFUND_STATE_INVALID(3162, "订单退款中,请勿重复申请"),

    /**
     * 退款人数和数量不一致
     */
    REFUND_VISITOR(3163, "退款人数和数量不一致"),

    /**
     * 退款申请已审核
     */
    REFUND_AUDITED(3165, "退款申请已审核"),

    /**
     * 订单不在退款中
     */
    NO_REFUND_STATE(3166, "订单不在退款中"),

    /**
     * 退款记录未查询到
     */
    REFUND_NOT_FOUND(3167, "退款记录未查询到"),

    /**
     * 累计退款金额大于实付金额
     */
    TOTAL_REFUND_MAX(3168, "累计退款金额大于实付金额"),

    /**
     * 请勿重复退款
     */
    ITEM_REFUND(3169, "请勿重复退款"),

    /**
     * 该订单已超过售后时间
     */
    ITEM_REFUND_EXPIRE(3170, "该订单已超过售后时间"),

    /**
     * 累计退款数量大于实付数量
     */
    TOTAL_REFUND_MAX_NUM(3171, "累计退款数量大于实付数量"),

    /**
     * 订单状态不符合退款要求
     */
    VISITOR_STATE_ERROR(3169, "订单状态不符合退款要求"),

    /**
     * 订单状态不匹配
     */
    ORDER_STATE_MATCH(3170, "订单状态不匹配"),

    /**
     * 订单状态不匹配,无法核销
     */
    ORDER_NOT_VERIFY(3172, "订单状态不匹配,无法核销"),

    /**
     * 该房型已下架
     */
    HOMESTAY_ROOM_DOWN(3173, "该房型已下架"),

    /**
     * 该房型已删除
     */
    HOMESTAY_ROOM_NULL(3172, "房型信息未查询到"),

    /**
     * 房间库存不足, 请刷新页面
     */
    HOMESTAY_CONFIG_NULL(3175, "房间库存不足,请刷新页面"),

    /**
     * 房间已预订满
     */
    HOMESTAY_STOCK(3176, "房间已预订满"),

    /**
     * 餐饮券未查询到
     */
    VOUCHER_NULL(3177, "餐饮券未查询到"),

    /**
     * 该餐饮券已下架
     */
    VOUCHER_DOWN(3178, "该餐饮券已下架"),

    /**
     * 餐饮券库存不足
     */
    VOUCHER_STOCK(3179, "餐饮券库存不足"),

    /**
     * 餐饮单次购买上限为%s张
     */
    VOUCHER_QUOTA(3180, "单次购买上限为%s张"),

    /**
     * 线路名称重复
     */
    LINE_TITLE_REDO(3181, "线路名称重复"),

    /**
     * 该线路商品已下架
     */
    LINE_DOWN(3182, "该线路商品已下架"),

    /**
     * 线路信息未查询到
     */
    LINE_NULL(3182, "线路信息未查询到"),

    /**
     * 线路库存不足
     */
    LINE_STOCK(3183, "线路库存不足"),

    /**
     * 该日期不可预定
     */
    LINE_NOT_ORDER(3184, "该日期不可预定"),

    /**
     * 商品订单未查询到
     */
    ITEM_ORDER_NULL(3185, "商品订单未查询到"),

    /**
     * 订单信息不匹配
     */
    ORDER_NOT_MATCH(3186, "订单信息不匹配"),

    /**
     * 该商品已申请退款
     */
    ORDER_REFUND_APPLY(3187, "该商品已申请退款"),

    /**
     * 线路库存不足
     */
    LINE_STOCK_NULL(3188, "线路库存不足"),

    /**
     * 商品退款数量不匹配
     */
    REFUND_MUM_MATCH(3189, "商品退款数量不匹配"),

    /**
     * 订单状态不匹配,无法退款
     */
    REFUND_STATE(3190, "订单状态不匹配,无法退款"),

    /**
     * 线路商品不存在
     */
    LINE_DELETE(3192, "线路商品不存在"),

    /**
     * 线路所属旅行社下架啦
     */
    TRAVEL_AGENCY_DOWN(3194, "线路所属旅行社下架啦"),

    /**
     * 状态机[%s]未注册
     */
    STATE_MACHINE_REGISTER(3200, "状态机[%s]未注册"),

    /**
     * 该景区尚未提交审核
     */
    SCENIC_NOT_UP(3201, "该景区尚未提交审核"),

    /**
     * 景区不存在或已删除
     */
    SCENIC_DELETE(3202, "景区不存在或已删除"),

    /**
     * 门票名称重复
     */
    SCENIC_TICKET_REDO(3203, "门票名称重复"),

    /**
     * 景区名称重复
     */
    SCENIC_REDO(3204, "景区名称重复"),

    /**
     * 该景区尚未提交审核
     */
    SCENIC_TICKET_NOT_UP(3205, "该门票尚未提交审核"),

    /**
     * 该民宿尚未提交审核
     */
    HOMESTAY_NOT_UP(3206, "该民宿尚未提交审核"),

    /**
     * 门票订单未查询到
     */
    TICKET_ORDER_NULL(3207, "门票订单未查询到"),

    /**
     * 免费票无需退款
     */
    TICKET_ORDER_FREE(3209, "免费票无需退款"),

    /**
     * 商品类型不匹配
     */
    PRODUCT_TYPE_MATCH(3210, "商品类型不匹配"),

    /**
     * 公告信息未查询到
     */
    NOTICE_NOT_FOUND(3211, "公告信息未查询到"),

    /**
     * 公告信息未查询到
     */
    NOTICE_NOT_NULL(3212, "公告信息下架啦~"),

    /**
     * 商家信息不存在
     */
    RESTAURANT_NOT_FOUND(3213, "商家信息不存在"),

    /**
     * 退款方式不支持
     */
    REFUND_TYPE_NOT_MATCH(3215, "退款方式不支持"),

    /**
     * 商户账号或密码错误
     */
    MERCHANT_NOT_FOUND(3216, "商户账号或密码错误"),

    /**
     * 商户账号锁定,请联系管理员解锁
     */
    MERCHANT_LOCKED(3218, "商户账号锁定,请联系管理员解锁"),

    /**
     * 商户账号或密码错误
     */
    MERCHANT_PWD_ERROR(3220, "商户账号或密码错误"),

    /**
     * 餐饮券名称重复
     */
    VOUCHER_TITLE_REDO(3230, "餐饮券名称重复"),

    /**
     * 商家名称重复
     */
    RESTAURANT_TITLE_REDO(3233, "商家名称重复"),

    /**
     * 店铺名称重复
     */
    SHOP_TITLE_REDO(3233, "店铺名称重复"),

    /**
     * 商品名称重复
     */
    ITEM_TITLE_REDO(3237, "商品名称重复"),

    /**
     * 房型名称重复
     */
    ROOM_TITLE_REDO(3240, "房型名称重复"),

    /**
     * 优惠券可领取数量上限啦
     */
    COUPON_GET_MAX(3244, "优惠券可领取数量上限啦~"),

    /**
     * 活动名称重复啦~
     */
    ACTIVITY_TITLE_REDO(3250, "活动名称重复啦~"),

    /**
     * 活动名称或ID不能为空
     */
    ACTIVITY_TITLE_NULL(3251, "活动名称或ID不能为空"),

    /**
     * 活动已经结束啦~
     */
    ACTIVITY_DELETE(3254, "活动已经结束啦~"),

    /**
     * 开启定位后方可按距离排序
     */
    POSITION_NO(3258, "请开启定位"),

    /**
     * 最大预定间隔不能超过%d天
     */
    HOMESTAY_SEARCH_MAX(3259, "最大预定间隔不能超过%d天"),

    /**
     * 该民宿已下架
     */
    HOMESTAY_NULL(3263, "该民宿已下架"),

    /**
     * 该民宿已下架
     */
    HOMESTAY_DOWN(3266, "该民宿已下架"),

    /**
     * 该店铺已下架
     */
    SHOP_DOWN(3270, "该店铺已下架"),

    /**
     * 店铺信息未查询到
     */
    SHOP_NULL(3273, "店铺信息未查询到"),

    /**
     * 请先补全店铺信息
     */
    SHOP_NOT_PERFECT(3274, "请先补全店铺信息"),

    /**
     * 存在下架的店铺
     */
    ANY_SHOP_DOWN(3271, "存在下架的店铺"),

    /**
     * 该商家已下架
     */
    RESTAURANT_DOWN(3275, "该商家已下架"),

    /**
     * 旅行社名称重复
     */
    TRAVEL_AGENCY_REDO(3300, "旅行社名称重复"),

    /**
     * 旅行社信息不存在
     */
    TRAVEL_AGENCY_NOT_FOUND(3302, "旅行社信息不存在"),

    /**
     * 规格值重复啦
     */
    SKU_TITLE_REDO(3305, "规格值重复啦"),

    /**
     * 活动名称重复啦~
     */
    LOTTERY_REDO(3401, "活动名称重复啦~"),

    /**
     * 中奖比例总和应为100%
     */
    LOTTERY_RATIO(3403, "中奖比例总和应为100%"),

    /**
     * 抽奖配置位置错误
     */
    LOTTERY_POSITION(3405, "抽奖配置位置错误"),

    /**
     * 抽奖只能在未开始时才能编辑
     */
    LOTTERY_NOT_INIT(3408, "抽奖只能在未开始时才能编辑"),

    /**
     * 抽奖活动结束啦~
     */
    LOTTERY_NULL(3410, "抽奖活动结束啦~"),

    /**
     * 抽奖活动已删除
     */
    LOTTERY_DELETE(3411, "抽奖活动已删除"),

    /**
     * 抽奖活动过期啦
     */
    LOTTERY_EXPIRE(3412, "抽奖活动过期啦~"),

    /**
     * 抽奖太火爆啦~, 请稍后再试
     */
    LOTTERY_EXECUTE(3413, "抽奖太火爆啦~, 请稍后再试"),

    /**
     * 抽奖活动不在有效期
     */
    LOTTERY_STATE(3414, "抽奖活动不在有效期"),

    /**
     * 抽奖次数用完啦~
     */
    LOTTERY_TIME_EMPTY(3416, "抽奖次数用完啦~"),

    /**
     * 该奖品类型不支持
     */
    LOTTERY_PRIZE_ERROR(3418, "该奖品类型不支持"),

    /**
     * 商品太火爆啦,请稍后再试
     */
    ORDER_ERROR(3420, "商品太火爆啦,请稍后再试"),

    /**
     * 核销码已过期, 请重新扫码
     */
    VERIFY_EXPIRE_ERROR(3425, "核销码已过期, 请重新扫码"),

    /**
     * 用户[%s]状态异常,无法核销
     */
    VISITOR_VERIFY_ERROR(3426, "用户[%s]无法核销"),

    /**
     * 核销码不属于该商户,无法核销
     */
    VERIFY_ACCESS_DENIED(3427, "核销码不属于该商户,无法核销"),

    /**
     * 订单退款处理中,无法核销
     */
    ORDER_REFUND_PROCESS(3428, "订单退款处理中,无法核销"),

    /**
     * 无法核销其他店铺的订单
     */
    ILLEGAL_VERIFY(3429, "无法核销其他店铺的订单"),

    /**
     * 核销码错误, 请重新扫描
     */
    VERIFY_NO_ERROR(3430, "核销码错误, 请重新扫描"),

    /**
     * 核销类型匹配
     */
    VERIFY_TYPE_ERROR(3432, "核销类型匹配"),

    /**
     * 订单不支持扫码核销
     */
    VERIFY_ORDER_ERROR(3433, "订单不支持扫码核销"),

    /**
     * 核销状态不存在
     */
    VERIFY_STATE_ERROR(3435, "核销状态不存在"),

    /**
     * 红包金额太小啦~
     */
    RED_PACKET_ERROR(3600, "红包金额太小啦~"),

    /**
     * 订单未支付,不支持线下退款
     */
    ORDER_UN_PAY(3603, "订单未支付,不支持线下退款"),

    /**
     * 订单已关闭,不支持线下退款
     */
    ORDER_CLOSE_REFUND(3605, "订单已关闭,不支持线下退款"),

    /**
     * 退款用户与订单不匹配
     */
    MEMBER_REFUND_MATCH(3608, "退款用户与订单不匹配"),

    /**
     * 游客[%s]已退款,请勿重复退款
     */
    MEMBER_HAS_REFUND(3612, "游客[%s]已退款,请勿重复退款"),

    /**
     * 存在退款中的游客,不支持线下退款
     */
    MEMBER_HAS_REFUNDING(3615, "存在退款中的游客,不支持线下退款"),

    /**
     * 存在退款中的商品,不支持线下退款
     */
    ITEM_HAS_REFUNDING(3616, "存在退款中的商品,不支持线下退款"),

    /**
     * 存在退款中的游客,不支持线下退款
     */
    MEMBER_REFUNDING(3618, "存在退款中的游客,请稍后再试"),

    /**
     * 该账号已禁用,详细情况请联系客服
     */
    MEMBER_LOGIN_FORBID(3636, "账号已禁用,详细情况请联系客服"),

    /**
     * 标签id生成错误
     */
    ITEM_TAG_NULL(3646, "标签id生成错误"),

    /**
     * 标签已被使用,无法删除
     */
    TAG_USED(3647, "标签已被使用,无法删除"),

    /**
     * 标签层级太深,不支持创建
     */
    TAG_DEPTH(3648, "标签层级太深,不支持创建"),

    /**
     * 该快递模板无权限操作
     */
    EXPRESS_NULL(3640, "该快递模板无权限操作"),

    /**
     * 商品不属于同一个店铺
     */
    ITEM_NOT_STORE(3644, "商品不属于同一个店铺"),

    /**
     * 存在已下架的商品
     */
    ITEM_MAY_DOWN(3648, "存在已下架的商品"),

    /**
     * 该地区暂不支持配送
     */
    EXPRESS_NOT_SUPPORT(3653, "该地区暂不支持配送"),

    /**
     * 商品参数非法
     */
    SKU_ITEM_MATCH(3658, "商品参数非法"),

    /**
     * 请选择商品
     */
    ORDER_ITEM_NULL(3662, "请选择商品"),

    /**
     * 请选择要发货的商品
     */
    ORDER_ITEM_CHOOSE(3663, "请选择要发货的商品"),

    /**
     * 该模板已关联商品, 无法修改计费方式
     */
    EXPRESS_CHARGE_MODE(3664, "物流模板已关联商品, 无法修改计费方式"),

    /**
     * 该模板已关联商品, 无法删除模板
     */
    EXPRESS_NOT_DELETE(3665, "物流模板已关联商品, 无法删除模板"),

    /**
     * 请选择未退款的商品
     */
    CHOOSE_NO_REFUND(3666, "请选择未退款的商品"),

    /**
     * 请选择未发货的商品
     */
    CHOOSE_NO_DELIVERY(3667, "请选择未发货的商品"),

    /**
     * 请选择需要发快递的商品
     */
    CHOOSE_EXPRESS(3668, "请选择需要发快递的商品"),

    /**
     * 物流模板不存在或已删除
     */
    EXPRESS_NOT_FOUND(3669, "物流模板不存在或已删除"),

    /**
     * 物流模板为计重方式,请填写商品重量
     */
    EXPRESS_WEIGHT(3670, "物流模板为计重方式,请填写商品重量"),

    /**
     * 订单信息未查询到
     */
    PRODUCT_SNAPSHOT_NULL(3673, "订单信息未查询到"),

    /**
     * 订单评价重复啦~
     */
    EVALUATION_REDO(3674, "订单评价重复啦~"),

    /**
     * 订单状态不合法, 无法评价
     */
    ORDER_COMPLETE(3675, "订单状态不合法, 无法评价"),

    /**
     * 评论信息未查询到
     */
    EVALUATION_NULL(3677, "评论信息未查询到"),

    /**
     * 商户用户未查询到
     */
    MERCHANT_USER_NULL(3680, "商户用户未查询到"),

    /**
     * 单位名称重复啦
     */
    AUTH_TITLE_REDO(3683, "单位名称重复啦"),

    /**
     * 快递信息未查询到
     */
    EXPRESS_SELECT_NULL(3686, "快递信息未查询到"),

    /**
     * 区域名称重复
     */
    AREA_TITLE_REDO(3688, "区域名称重复"),

    /**
     * 区域编号重复
     */
    AREA_CODE_REDO(3690, "区域编号重复"),

    /**
     * POI类型重复
     */
    TYPE_CODE_REDO(3690, "POI类型重复"),

    /**
     * POI类型已被使用
     */
    TYPE_POINT_OCCUPY(3693, "POI类型已被使用"),

    /**
     * 点位名称重复
     */
    AREA_POINT_REDO(3695, "点位名称重复"),

    /**
     * POI点位信息不存在
     */
    AREA_POINT_NULL(3696, "POI点位信息不存在"),

    /**
     * 请先绑定点位信息
     */
    BIND_POINT_NULL(3697, "请先绑定点位信息"),

    /**
     * 线路名称重复
     */
    POI_LINE_REDO(3700, "线路名称重复"),

    /**
     * 线路信息不存在
     */
    POI_LINE_NULL(3703, "线路信息不存在"),

    /**
     * 标题名称重复啦
     */
    NEWS_TITLE_REDO(3800, "标题名称重复啦"),

    /**
     * 分类名称重复啦
     */
    NEWS_CONFIG_TITLE_REDO(3805, "分类名称重复啦"),

    /**
     * 分类编号重复啦
     */
    NEWS_CONFIG_CODE_REDO(3806, "分类编号重复啦"),

    /**
     * 文章从地球上消失啦~
     */
    NEWS_NULL(3808, "文章从地球上消失啦~"),

    /**
     * 退款金额不能超过%s元
     */
    REFUND_AMOUNT_MAX(3810, "退款金额不能超过%s元"),

    /**
     * 该订单已确认
     */
    ORDER_CONFIRM(3813, "该订单已确认"),

    /**
     * 订单已发货,请退货退款
     */
    REFUND_DELIVERY(3815, "订单已发货,只支持退货退款"),

    /**
     * 商户账户更新失败
     */
    ACCOUNT_UPDATE(3818, "商户账户更新失败"),

    /**
     * 商户积分账户更新失败
     */
    SCORE_ACCOUNT_UPDATE(3819, "商户积分账户更新失败"),

    /**
     * 商户授权二维码已过期,请重新生成
     */
    MERCHANT_CODE_EXPIRE(3820, "商户授权二维码已过期,请重新生成"),

    /**
     * 商户信息未查询到
     */
    MERCHANT_NULL(3822, "商户信息未查询到"),

    /**
     * 商户已绑定微信号
     */
    MERCHANT_BINDING(3824, "商户已绑定微信号"),

    /**
     * 商户未绑定微信号,无需解绑
     */
    MERCHANT_NO_BIND(3825, "商户未绑定微信号,无需解绑"),

    /**
     * 商户可用余额不足
     */
    MERCHANT_ACCOUNT_USE(3826, "商户可用余额不足"),

    /**
     * 商户支付冻结余额不足
     */
    MERCHANT_ACCOUNT_PAY(3827, "商户支付冻结余额不足"),

    /**
     * 商户提现冻结余额不足
     */
    MERCHANT_ACCOUNT_WITHDRAW(3827, "商户提现冻结余额不足"),

    /**
     * 商户可用积分不足
     */
    MERCHANT_SCORE_USE(3829, "商户可用积分不足"),

    /**
     * 商户冻结积分不足
     */
    MERCHANT_SCORE_PAY(3830, "商户支付冻结积分不足"),

    /**
     * 商户退款冻结积分不足
     */
    MERCHANT_SCORE_WITHDRAW(3831, "商户退款冻结积分不足"),

    /**
     * 页面类型不存在
     */
    VISIT_TYPE_NULL(3830, "页面类型不存在"),

    /**
     * 房间数与入住信息不匹配
     */
    VISITOR_NO_MATCH(3831, "房间数与入住信息不匹配"),

    /**
     * 拼团活动名称重复
     */
    REDO_TITLE_BOOKING(3834, "拼团活动名称重复"),

    /**
     * 该商品已添加拼团活动
     */
    ITEM_BOOKING(3836, "该商品已添加拼团活动"),

    /**
     * 拼团商品不支持购物车下单
     */
    ITEM_MULTIPLE_BOOKING(3837, "拼团商品不支持购物车下单"),

    /**
     * 进行中活动不支持编辑
     */
    ACTIVITY_NOT_EDIT(3838, "进行中活动不支持编辑"),

    /**
     * 进行中拼团不能删除
     */
    BOOKING_DELETE(3839, "进行中拼团不能删除"),

    /**
     * 活动时间必须大于当前时间
     */
    BOOKING_GT_TIME(3842, "活动时间必须大于当前时间"),

    /**
     * 拼团活动结束时间不能大于一个月
     */
    BOOKING_GT_MONTH(3843, "拼团活动结束时间不能大于一个月"),

    /**
     * 活动时间必须大于当前时间
     */
    ITEM_CHECK_QUOTA(3846, "[%s]限购数量:d%"),

    /**
     * 拼团活动不在有效期
     */
    ITEM_GROUP_NULL(3848, "拼团活动不在有效期"),

    /**
     * 拼团人数凑满啦~
     */
    ITEM_GROUP_COMPLETE(3850, "拼团人数凑满啦~"),

    /**
     * 拼团活动结束啦~
     */
    ITEM_GROUP_OVER(3852, "拼团活动结束啦~"),

    /**
     * 拼团活动不存在
     */
    GROUP_ORDER_NULL(3854, "拼团活动不存在"),

    /**
     * 限时购活动名称重复
     */
    REDO_TITLE_LIMIT(3835, "限时购活动名称重复啦"),

    /**
     * 活动时间必须大于当前时间
     */
    LIMIT_GT_TIME(3856, "活动时间必须大于当前时间"),

    /**
     * 活动时间跨度不能大于一个月
     */
    LIMIT_GT_MONTH(3857, "活动时间跨度不能大于一个月"),

    /**
     * 该商品已存在限时购活动
     */
    LIMIT_ITEM_REDO(3858, "该商品已存在限时购活动"),

    /**
     * 进行中的活动暂无法删除
     */
    LIMIT_UNDERWAY_DELETE(3859, "进行中的活动暂无法删除"),

    /**
     * 限时购商品不存在或已删除
     */
    LIMIT_ITEM_NULL(3860, "限时购商品不存在或已删除"),

    /**
     * 限时购活动删除啦~
     */
    LIMIT_NULL(3861, "限时购活动删除啦~"),

    /**
     * 场馆名称重复啦~
     */
    VENUE_REDO(3862, "场馆名称重复啦~"),

    /**
     * 场馆信息未查询到
     */
    VENUE_NULL(3864, "场馆信息未查询到"),

    /**
     * 场地名称重复啦~
     */
    VENUE_SITE_REDO(3866, "场地名称重复啦~"),

    /**
     * 场地信息未查询到
     */
    VENUE_SITE_NULL(3868, "场地信息未查询到"),

    /**
     * 场次名称重复啦~
     */
    VENUE_SESSION_REDO(3870, "场地名称重复啦~"),

    /**
     * 场次信息未查询到
     */
    VENUE_SESSION_NULL(3872, "场地信息未查询到"),

    /**
     * 该时间段已被预约
     */
    VENUE_STOCK(3875, "该时间段已被预约"),

    /**
     * 该场次已下架
     */
    VENUE_SITE_DOWN(3876, "该场次已下架"),

    /**
     * 该场次已下架
     */
    VENUE_DOWN(3877, "该场馆已下架"),

    /**
     * 不支持跨天预约
     */
    VENUE_SKIP(3879, "不支持跨天预约"),

    /**
     * 不支持多场馆预约
     */
    VENUE_MULTI(3880, "不支持多场馆预约"),

    /**
     * 不支持跨场地预约
     */
    VENUE_SITE_MULTI(3882, "不支持跨场地预约"),

    /**
     * 兑换码名称重复啦
     */
    REDEEM_CODE_REDO(3885, "兑换码名称重复啦"),

    /**
     * 兑换码配置未查询到
     */
    REDEEM_CODE_NULL(3888, "兑换码配置未查询到"),

    /**
     * 兑换码已发放,无法删除
     */
    REDEEM_CODE_DELETE(3890, "兑换码已发放,无法删除"),

    /**
     * 兑换码已发放,无法修改
     */
    REDEEM_CODE_UPDATE(3892, "兑换码已发放,无法修改"),

    /**
     * 兑换码已发放
     */
    REDEEM_CODE_GENERATE(3895, "兑换码已发放"),

    /**
     * 退款信息未查询到
     */
    REFUND_LOG_NULL(3898, "退款信息未查询到"),

    /**
     * 请勿重复退款
     */
    REFUND_LOG_STATE(3899, "请勿重复退款"),

    /**
     * 请勿重复取消退款
     */
    REFUND_LOG_CANCEL(3900, "请勿重复取消退款"),

    /**
     * 退款进行中,无法取消
     */
    REFUND_LOG_AUDIT(3903, "退款进行中,无法取消"),

    /**
     * 无需退款审核
     */
    REFUND_AUDIT(3905, "%s无需退款审核"),

    /**
     * 兑换码无效
     */
    CD_KEY_INVALID(3907, "兑换码无效"),

    /**
     * 兑换码不在有效期
     */
    CD_KEY_EXPIRE(3909, "兑换码不在有效期"),

    /**
     * 兑换码已使用
     */
    CD_KEY_USED(3919, "兑换码已使用"),

    /**
     * 兑换码不适用该商品
     */
    CD_KEY_STORE_SCOPE(3922, "兑换码不适用该商品"),

    /**
     * 兑换码不适用该商品
     */
    CD_KEY_PRODUCT_SCOPE(3923, "兑换码不适用该商品"),

    /**
     * 请核对当前账户是否为商户
     */
    ACCOUNT_NOT_EXIST(3924, "请核对当前账户是否为商户"),

    /**
     * 拼团活动未查询到
     */
    BOOKING_NULL(3926, "拼团活动未查询到"),

    /**
     * 您已在该拼团中,请勿重复下单
     */
    BOOKING_REDO_ORDER(3927, "您已在该拼团中,请勿重复下单"),

    /**
     * 可提现金额不足
     */
    WITHDRAW_ENOUGH(3928, "可提现金额不足"),

    /**
     * 积分变动记录未查询到
     */
    SCORE_LOG_NULL(3930, "积分变动记录未查询到"),

    /**
     * 资金变动记录未查询到
     */
    ACCOUNT_LOG_NULL(3932, "资金变动记录未查询到"),

    /**
     * 扫码充值记录未查询到
     */
    RECHARGE_LOG_NULL(3934, "扫码充值记录未查询到"),

    /**
     * 积分余额不足
     */
    MEMBER_SCORE_ERROR(3936, "积分余额不足"),

    /**
     * 积分奖品不存在
     */
    SCORE_PRIZE_NULL(3938, "积分奖品不存在"),

    /**
     * 中奖数量更新失败
     */
    PRIZE_WIN_ERROR(3939, "中奖数量更新失败"),

    /**
     * 抽奖活动已经结束啦
     */
    LOTTERY_CONFIG_NULL(3942, "抽奖活动已经结束啦"),

    /**
     * 订单冻结记录不存在
     */
    FREEZE_LOG_NULL(3944, "订单冻结记录不存在"),

    /**
     * 订单冻结记录已解冻
     */
    FREEZE_LOG_UNFREEZE(3945, "订单冻结记录已解冻"),

    /**
     * 冻结金额和解冻金额不匹配
     */
    FREEZE_LOG_AMOUNT(3947, "冻结金额和解冻金额不匹配"),

    /**
     * 标签名称重复啦~
     */
    TAG_TITLE_REDO(3949, "标签名称重复啦~"),

    /**
     * 标签信息不存在
     */
    TAG_NULL(3952, "标签信息不存在"),

    /**
     * 请选择会员
     */
    TAG_SCOPE_NULL(3954, "请选择会员"),

    /**
     * 请选择会员
     */
    SMS_SCOPE_NULL(3956, "请选择会员"),

    /**
     * 请选择会员
     */
    SCORE_INTEGER(3958, "积分必须的100倍数"),

    /**
     * 积分太多啦~
     */
    SCORE_SURPLUS(3961, "积分太多啦~"),

    /**
     * 您的可用积分不足
     */
    SCORE_NOT_ENOUGH(3963, "您的可用积分不足"),

    /**
     * 商户资金不为零,无法注销
     */
    MERCHANT_HAS_FREEZE(3964, "商户资金不为零,无法注销"),

    /**
     * 商户积分不为零,无法注销
     */
    MERCHANT_SCORE_HAS_FREEZE(3965, "商户积分不为零,无法注销"),

    /**
     * 访问渠道不能为空
     */
    CHANNEL_NULL(3966, "访问渠道不能为空"),

    /**
     * 请选择合适的预约日期
     */
    VISITE_DATE_ILLEGAL(3968, "请选择合适的预约日期"),

    /**
     * 该地址已被店铺占用,请先更换店铺地址
     */
    ADDRESS_OCCUPIED(3969, "该地址已被店铺占用,请先更换店铺地址"),

    /**
     * 该订单尚未支付,不支持退款
     */
    ORDER_NOT_PAY(3972, "该订单尚未支付,不支持退款"),

    /**
     * 店铺信息不存在
     */
    STORE_NOT_EXIST(4000, "店铺信息不存在"),

    /**
     * 微信公众号尚未配置
     */
    MP_NOT_CONFIG(4000, "微信公众号尚未配置"),

    /**
     * 微信网页授权异常
     */
    MP_JS_AUTH(4001, "微信网页授权异常"),

    /**
     * 微信公众号尚未配置
     */
    MA_NOT_CONFIG(4002, "微信小程序尚未配置"),

    /**
     * 小程序手机号授权异常
     */
    MA_JS_AUTH(4003, "小程序手机号授权异常"),

    /**
     * 小程序手机号授权为空
     */
    MA_AUTH_NULL(4004, "小程序手机号授权为空"),

    /**
     * 钉钉客户端初始化异常
     */
    DING_TALK_INIT(5000, "钉钉客户端初始化异常"),


    ;

    /**
     * 错误代码
     */
    private final int code;

    /**
     * 错误信息
     */
    private final String msg;

}
